# Задача 2
# Создайте список "города" с именами любых городов
# Количество элементов в списке "города" не меньше 3!

# Создайте список списков населения перечисленных городов

# Выведите на консоль население второго города в списке в формате
# Население Москвы - ХХ человек

# Выведите на консоль общий размер населения перечисленных городов как сумму населения всех городов
# Итого размер населения - ХХ человек

cities = [['Кабул', 'Исламабад', 'Багдад'], ['4 млн. чел', '8 млн. чел', '9 млн. чел']]

print(f'Население {cities[0][1]} - {cities[1][1]}.')
print(f'Итого размер населения - {cities[0][0]}а, {cities[0][1]}а, {cities[0][2]}а человек - 21 млн. чел.')